; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v6 ?v5)
             (pred_2 ?v13 ?v10)
             (pred_6 ?v6 ?v10)
             (pred_1 ?v2 ?v6 )
	     (pred_3 ?v6)
             (pred_9 ?v8)
             (pred_10 ?v13)
             (pred_11 ?v10)
             (pred_5 ?v6)
             (pred_4 ?v13)
             (pred_12 ?v6)
             (pred_7 ))



(:action op_4
:parameters (?v3 ?v7 ?v9 ?v11)
:precondition (and (pred_9 ?v3) (pred_9 ?v7) (pred_10 ?v9) (pred_11 ?v11)
          (pred_8 ?v3 ?v7) (pred_2 ?v9 ?v11)
                   (pred_6 ?v7 ?v11) (pred_3 ?v3) 
                   (pred_5 ?v7) (pred_4 ?v9))
:effect (and  (pred_12 ?v7) (not (pred_5 ?v7))))


(:action op_2
:parameters (?v3 ?v1)
:precondition (and (pred_9 ?v3) (pred_9 ?v1)
               (pred_3 ?v3) (pred_8 ?v3 ?v1) (pred_12 ?v1))
:effect (and (pred_3 ?v1) (not (pred_3 ?v3))))

(:action op_1
:parameters (?v3 ?v9)
:precondition (and (pred_9 ?v3) (pred_10 ?v9) 
                  (pred_3 ?v3) (pred_1 ?v9 ?v3) (pred_7 ))
:effect (and (pred_4 ?v9)
   (not (pred_1 ?v9 ?v3)) (not (pred_7 ))))


(:action op_5
:parameters (?v3 ?v4 ?v12)
:precondition (and (pred_9 ?v3) (pred_10 ?v4) (pred_10 ?v12)
                  (pred_3 ?v3) (pred_4 ?v12) (pred_1 ?v4 ?v3))
:effect (and (pred_4 ?v4) (pred_1 ?v12 ?v3)
        (not (pred_4 ?v12)) (not (pred_1 ?v4 ?v3))))

(:action op_3
:parameters (?v3 ?v9)
:precondition (and (pred_9 ?v3) (pred_10 ?v9) 
                  (pred_3 ?v3) (pred_4 ?v9))
:effect (and (pred_7 ) (pred_1 ?v9 ?v3) (not (pred_4 ?v9)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_10 obj_05 obj_02 obj_21 obj_20 obj_17 obj_16 obj_19 obj_24 obj_03 obj_11 obj_23 obj_09 obj_30 obj_04 obj_15 obj_26 obj_07 obj_25 obj_12 obj_22 obj_13 obj_28 obj_29 obj_06
    obj_31 obj_08 obj_14
    obj_01 obj_18 obj_27
    )

    (:init
       (pred_7)

       (pred_9 obj_10)
       (pred_9 obj_05)
       (pred_9 obj_02)
       (pred_9 obj_21)
       (pred_9 obj_20)
       (pred_9 obj_17)
       (pred_9 obj_16)
       (pred_9 obj_19)
       (pred_9 obj_24)
       (pred_9 obj_03)
       (pred_9 obj_11)
       (pred_9 obj_23)
       (pred_9 obj_09)
       (pred_9 obj_30)
       (pred_9 obj_04)
       (pred_9 obj_15)
       (pred_9 obj_26)
       (pred_9 obj_07)
       (pred_9 obj_25)
       (pred_9 obj_12)
       (pred_9 obj_22)
       (pred_9 obj_13)
       (pred_9 obj_28)
       (pred_9 obj_29)
       (pred_9 obj_06)
       (pred_11 obj_31)
       (pred_11 obj_08)
       (pred_11 obj_14)
       (pred_10 obj_01)
       (pred_10 obj_18)
       (pred_10 obj_27)

       (pred_8 obj_10 obj_17)
       (pred_8 obj_10 obj_05)
       (pred_8 obj_05 obj_16)
       (pred_8 obj_05 obj_02)
       (pred_8 obj_05 obj_10)
       (pred_8 obj_02 obj_19)
       (pred_8 obj_02 obj_21)
       (pred_8 obj_02 obj_05)
       (pred_8 obj_21 obj_24)
       (pred_8 obj_21 obj_20)
       (pred_8 obj_21 obj_02)
       (pred_8 obj_20 obj_03)
       (pred_8 obj_20 obj_21)
       (pred_8 obj_17 obj_11)
       (pred_8 obj_17 obj_16)
       (pred_8 obj_17 obj_10)
       (pred_8 obj_16 obj_23)
       (pred_8 obj_16 obj_19)
       (pred_8 obj_16 obj_05)
       (pred_8 obj_16 obj_17)
       (pred_8 obj_19 obj_09)
       (pred_8 obj_19 obj_24)
       (pred_8 obj_19 obj_02)
       (pred_8 obj_19 obj_16)
       (pred_8 obj_24 obj_30)
       (pred_8 obj_24 obj_03)
       (pred_8 obj_24 obj_21)
       (pred_8 obj_24 obj_19)
       (pred_8 obj_03 obj_04)
       (pred_8 obj_03 obj_20)
       (pred_8 obj_03 obj_24)
       (pred_8 obj_11 obj_15)
       (pred_8 obj_11 obj_23)
       (pred_8 obj_11 obj_17)
       (pred_8 obj_23 obj_26)
       (pred_8 obj_23 obj_09)
       (pred_8 obj_23 obj_16)
       (pred_8 obj_23 obj_11)
       (pred_8 obj_09 obj_07)
       (pred_8 obj_09 obj_30)
       (pred_8 obj_09 obj_19)
       (pred_8 obj_09 obj_23)
       (pred_8 obj_30 obj_25)
       (pred_8 obj_30 obj_04)
       (pred_8 obj_30 obj_24)
       (pred_8 obj_30 obj_09)
       (pred_8 obj_04 obj_12)
       (pred_8 obj_04 obj_03)
       (pred_8 obj_04 obj_30)
       (pred_8 obj_15 obj_22)
       (pred_8 obj_15 obj_26)
       (pred_8 obj_15 obj_11)
       (pred_8 obj_26 obj_13)
       (pred_8 obj_26 obj_07)
       (pred_8 obj_26 obj_23)
       (pred_8 obj_26 obj_15)
       (pred_8 obj_07 obj_28)
       (pred_8 obj_07 obj_25)
       (pred_8 obj_07 obj_09)
       (pred_8 obj_07 obj_26)
       (pred_8 obj_25 obj_29)
       (pred_8 obj_25 obj_12)
       (pred_8 obj_25 obj_30)
       (pred_8 obj_25 obj_07)
       (pred_8 obj_12 obj_06)
       (pred_8 obj_12 obj_04)
       (pred_8 obj_12 obj_25)
       (pred_8 obj_22 obj_13)
       (pred_8 obj_22 obj_15)
       (pred_8 obj_13 obj_28)
       (pred_8 obj_13 obj_26)
       (pred_8 obj_13 obj_22)
       (pred_8 obj_28 obj_29)
       (pred_8 obj_28 obj_07)
       (pred_8 obj_28 obj_13)
       (pred_8 obj_29 obj_06)
       (pred_8 obj_29 obj_25)
       (pred_8 obj_29 obj_28)
       (pred_8 obj_06 obj_12)
       (pred_8 obj_06 obj_29)
       (pred_5 obj_19)
       (pred_5 obj_23)
       (pred_5 obj_09)
       (pred_6  obj_19 obj_31)
       (pred_6  obj_23 obj_08)
       (pred_6  obj_09 obj_14)
       (pred_12 obj_10)
       (pred_12 obj_05)
       (pred_12 obj_02)
       (pred_12 obj_21)
       (pred_12 obj_20)
       (pred_12 obj_17)
       (pred_12 obj_16)
       (pred_12 obj_24)
       (pred_12 obj_03)
       (pred_12 obj_11)
       (pred_12 obj_30)
       (pred_12 obj_04)
       (pred_12 obj_15)
       (pred_12 obj_26)
       (pred_12 obj_07)
       (pred_12 obj_25)
       (pred_12 obj_12)
       (pred_12 obj_22)
       (pred_12 obj_13)
       (pred_12 obj_28)
       (pred_12 obj_29)
       (pred_12 obj_06)

       (pred_2  obj_01 obj_31)
       (pred_2  obj_18 obj_08)
       (pred_2  obj_27 obj_14)
       (pred_1 obj_01 obj_10)
       (pred_1 obj_18 obj_20)
       (pred_1 obj_27 obj_25)
       (pred_3 obj_12)
    )

    (:goal (and
       (pred_1 obj_01 obj_20)
    ))
(:constraints
  (always (not (pred_3 obj_21)))
)
)

; plan
1. (op_2 obj_12 obj_25)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_25)
   goals met: 0 of 1
2. (op_2 obj_25 obj_07)
   deleted: (pred_3 obj_25)
   added: (pred_3 obj_07)
   goals met: 0 of 1
3. (op_2 obj_07 obj_26)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_26)
   goals met: 0 of 1
4. (op_2 obj_26 obj_15)
   deleted: (pred_3 obj_26)
   added: (pred_3 obj_15)
   goals met: 0 of 1
5. (op_2 obj_15 obj_11)
   deleted: (pred_3 obj_15)
   added: (pred_3 obj_11)
   goals met: 0 of 1
6. (op_2 obj_11 obj_17)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_17)
   goals met: 0 of 1
7. (op_2 obj_17 obj_10)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_10)
   goals met: 0 of 1
8. (op_1 obj_10 obj_01)
   deleted: (pred_1 obj_01 obj_10) (pred_7)
   added: (pred_4 obj_01)
   goals met: 0 of 1
9. (op_2 obj_10 obj_05)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_05)
   goals met: 0 of 1
10. (op_2 obj_05 obj_02)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_02)
   goals met: 0 of 1
11. (op_4 obj_02 obj_19 obj_01 obj_31)
   deleted: (pred_5 obj_19)
   added: (pred_12 obj_19)
   goals met: 0 of 1
12. (op_2 obj_02 obj_19)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_19)
   goals met: 0 of 1
13. (op_2 obj_19 obj_24)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_24)
   goals met: 0 of 1
14. (op_2 obj_24 obj_03)
   deleted: (pred_3 obj_24)
   added: (pred_3 obj_03)
   goals met: 0 of 1
15. (op_2 obj_03 obj_20)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_20)
   goals met: 0 of 1
16. (op_5 obj_20 obj_18 obj_01)
   deleted: (pred_4 obj_01) (pred_1 obj_18 obj_20)
   added: (pred_4 obj_18) (pred_1 obj_01 obj_20)
   goals met: 1 of 1
